{
  "schema_type": "division_toe",
  "schema_version": "3.1.0",
  "nation": "german",
  "quarter": "1943q1",
  "unit_designation": "Hermann Göring Division",
  "unit_type": "panzer_division",
  "organization_level": "division",
  "parent_formation": "5. Panzerarmee (Tunisia)",
  
  "command": {
    "commander": {
      "name": "Generalmajor Joseph Schmid",
      "rank": "Generalmajor",
      "appointment_date": "1942-11",
      "previous_service": "Luftwaffe Flak Command",
      "notes": "Commanded Kampfgruppe Schmid in Tunisia. Awarded Knight's Cross 21 May 1944 for Tunisia leadership"
    },
    "headquarters_location": "Tunisia (mobile)",
    "staff_strength": {
      "officers": 45,
      "enlisted": 150
    }
  },
  
  "operational_status": {
    "status": "partial_deployment_combat_ready",
    "description": "Division deployed piecemeal to Tunisia Nov 1942-March 1943 as Kampfgruppe Schmid. Panzer regiment and full division assets still forming in Mont-de-Marsan, France. Estimated 7,000-11,000 personnel deployed to Tunisia. Full division never assembled in theater before capitulation May 1943.",
    "date_range": "1943-01-01 to 1943-03-31",
    "strength_level": "60% authorized (partial deployment)",
    "readiness": "combat_ready_partial"
  },
  
  "total_personnel": 9000,
  "officers": 350,
  "ncos": 1500,
  "enlisted": 7150,
  
  "top_3_infantry_weapons": {
    "1": {
      "weapon": "Karabiner 98k",
      "count": 5400,
      "type": "rifle"
    },
    "2": {
      "weapon": "MG 34",
      "count": 180,
      "type": "machine_gun"
    },
    "3": {
      "weapon": "MP 40",
      "count": 420,
      "type": "submachine_gun"
    }
  },
  
  "ground_vehicles_total": 420,
  
  "tanks": {
    "total": 0,
    "operational": 0,
    "notes": "Panzer-Regiment Hermann Göring was still forming in Mont-de-Marsan, France during Tunisia deployment. No tank battalion deployed to Tunisia with Kampfgruppe Schmid in 1943 Q1. Division fought primarily as motorized infantry with heavy flak support.",
    "heavy_tanks": {
      "total": 0,
      "variants": {}
    },
    "medium_tanks": {
      "total": 0,
      "variants": {}
    },
    "light_tanks": {
      "total": 0,
      "variants": {}
    }
  },
  
  "halftracks": {
    "total": 45,
    "variants": {
      "Sd.Kfz. 251": {
        "count": 35,
        "role": "infantry_transport",
        "notes": "Used by deployed grenadier elements"
      },
      "Sd.Kfz. 250": {
        "count": 10,
        "role": "reconnaissance_command"
      }
    }
  },
  
  "armored_cars": {
    "total": 18,
    "variants": {
      "Sd.Kfz. 222": {
        "count": 12,
        "armament": "20mm",
        "notes": "Reconnaissance elements"
      },
      "Sd.Kfz. 231": {
        "count": 6,
        "armament": "20mm"
      }
    }
  },
  
  "trucks": {
    "total": 280,
    "variants": {
      "Opel Blitz 3-ton": {
        "count": 180,
        "capacity": "3_ton"
      },
      "Mercedes-Benz L3000": {
        "count": 75,
        "capacity": "3_ton"
      },
      "Various light trucks": {
        "count": 25,
        "capacity": "1_ton"
      }
    }
  },
  
  "motorcycles": {
    "total": 77,
    "variants": {
      "BMW R75": {
        "count": 45,
        "type": "sidecar"
      },
      "Zündapp KS 750": {
        "count": 32,
        "type": "sidecar"
      }
    }
  },
  
  "artillery_total": 54,
  
  "field_artillery": {
    "total": 24,
    "variants": {
      "10.5 cm leFH 18": {
        "count": 18,
        "caliber": "105mm",
        "notes": "Light field howitzer, partial battalion"
      },
      "15 cm sFH 18": {
        "count": 6,
        "caliber": "150mm",
        "notes": "Heavy field howitzer, battery strength"
      }
    }
  },
  
  "anti_tank": {
    "total": 12,
    "variants": {
      "7.5 cm PaK 40": {
        "count": 8,
        "caliber": "75mm"
      },
      "5 cm PaK 38": {
        "count": 4,
        "caliber": "50mm"
      }
    }
  },
  
  "anti_aircraft": {
    "total": 18,
    "variants": {
      "8.8 cm FlaK 36/37": {
        "count": 8,
        "caliber": "88mm",
        "notes": "From Flak-Regiment General Göring elements. Primary heavy AA/AT capability"
      },
      "3.7 cm FlaK 36/37": {
        "count": 6,
        "caliber": "37mm"
      },
      "2 cm FlaK 38": {
        "count": 4,
        "caliber": "20mm"
      }
    }
  },
  
  "aircraft_total": 0,
  "fighters": {"total": 0, "variants": {}},
  "bombers": {"total": 0, "variants": {}},
  "reconnaissance": {"total": 0, "variants": {}},
  
  "supply_logistics": {
    "supply_status": "Severely constrained. Division deployed piecemeal via airlift and sea transport to Tunisia. Supply lines from Sicily increasingly interdicted by Allied air and naval forces. Fuel extremely limited due to shipping losses. Ammunition adequate for defensive operations only. No heavy equipment replacement capability. Units operating at 60% authorized strength due to partial deployment.",
    "fuel_reserves": "3-5 days combat operations. Critically dependent on Luftwaffe transport aircraft delivering fuel from Sicily. Estimated 40% of required fuel arriving due to Allied interdiction.",
    "ammunition_stores": "Adequate for 2 weeks defensive combat. Resupply via air transport only. Artillery ammunition prioritized over small arms due to weight/volume constraints.",
    "water_availability": "Adequate from local wells in coastal areas. Water discipline enforced due to desert operations. Water trucks operational but fuel constraints limit distribution.",
    "operational_radius": "Limited to 80-120km from supply depots due to fuel shortages. Division elements tied to coastal areas and road networks. No offensive operational capability beyond local counterattacks.",
    "notes": "Kampfgruppe Schmid operating under extreme logistical constraints. Full division supply train still in France. Units relying on captured British stocks and Luftwaffe air transport. Situation deteriorating rapidly January-March 1943."
  },
  
  "weather_environment": {
    "terrain": "Coastal plains and Eastern Dorsal mountains of Tunisia. Mixed terrain: coastal lowlands suitable for mechanized operations, mountainous interior favoring defense. Road network limited. Wadis (dry riverbeds) create obstacles during winter rains.",
    "temperature_range": "January-March 1943: Daytime 12-18°C (54-64°F), nighttime 4-10°C (39-50°F). Winter rainy season. Significantly colder and wetter than Western Desert. Occasional frost in mountains.",
    "seasonal_impacts": "Winter rainy season (Dec-March) severely impacts operations. Roads turn to mud, limiting mobility of wheeled vehicles. Tracked vehicles operable but maintenance challenging. Luftwaffe air support reduced by weather. Allied air superiority increases during clear periods. Troops inadequate winter clothing for night operations.",
    "environmental_challenges": "Mud and rain primary challenges Q1 1943. Vehicle maintenance difficult in field conditions. Spare parts unavailable. Dust storms occasional but less severe than Libya. Malaria risk in coastal marshes. Dysentery affects personnel. Mountain warfare in Dorsal range beyond division training.",
    "notes": "Tunisia weather significantly different from Western Desert. Division unprepared for winter mountain warfare. Mud and rain neutralize some Allied advantages but worsen German supply situation."
  },
  
  "subordinate_units": [
    {
      "designation": "Grenadier-Regiment 1 Hermann Göring",
      "type": "grenadier_regiment",
      "personnel": 2200,
      "notes": "Deployed to Tunisia. Two battalions operational. III. Battalion staff became I./Panzer-Regiment HG (remained in France). Regiment at 70% strength."
    },
    {
      "designation": "Grenadier-Regiment 2 Hermann Göring",
      "type": "grenadier_regiment",
      "personnel": 1800,
      "notes": "Formed from Jäger-Regiment Hermann Göring (ex-Fallschirmjäger-Regiment 5). Partially deployed to Tunisia. Elements still forming. At 60% strength."
    },
    {
      "designation": "Panzer-Regiment Hermann Göring",
      "type": "panzer_regiment",
      "personnel": 0,
      "notes": "NOT DEPLOYED. Regiment forming in Mont-de-Marsan, France during Tunisia campaign. No tanks arrived in Tunisia with Kampfgruppe Schmid."
    },
    {
      "designation": "Flak-Regiment General Göring (I. & II. Abteilung)",
      "type": "flak_regiment",
      "personnel": 1800,
      "notes": "Two battalions (I. & II.) deployed to Tunisia. Mixed 88mm heavy and 37mm/20mm light flak. Regiment destroyed in Tunisia May 1943. III. Abteilung remained in training in Europe."
    },
    {
      "designation": "Artillerie-Regiment Hermann Göring (Partial)",
      "type": "artillery_regiment",
      "personnel": 600,
      "notes": "Elements deployed, not full regiment. Primarily one battalion with 105mm howitzers. Regiment still forming in France."
    },
    {
      "designation": "Panzer-Aufklärungs-Abteilung Hermann Göring (Elements)",
      "type": "reconnaissance_battalion",
      "personnel": 380,
      "notes": "Partial deployment. Motorcycle and armored car companies. Kradschützen company destroyed in Tunisia May 1943."
    },
    {
      "designation": "Panzer-Pionier-Bataillon Hermann Göring (Elements)",
      "type": "engineer_battalion",
      "personnel": 420,
      "notes": "Engineer elements deployed for defensive fortification work. Full battalion not present."
    },
    {
      "designation": "Panzer-Nachrichten-Abteilung Hermann Göring (Elements)",
      "type": "signals_battalion",
      "personnel": 180,
      "notes": "Partial signals capability. Radio and wire communications."
    },
    {
      "designation": "Division Supply & Medical Services (Partial)",
      "type": "support_services",
      "personnel": 1200,
      "notes": "Minimal supply train. Medical services limited. Reliant on Luftwaffe logistics support."
    },
    {
      "designation": "Feldersatz-Bataillon Hermann Göring (Elements)",
      "type": "field_replacement_battalion",
      "personnel": 420,
      "notes": "Field replacement elements. Limited training capability in Tunisia."
    }
  ],
  
  "combat_history": {
    "battles": [
      {
        "name": "Tunisia Campaign",
        "date": "1943-01 to 1943-05",
        "role": "Defensive operations as Kampfgruppe Schmid",
        "outcome": "Division destroyed, surrendered May 12, 1943",
        "notes": "Deployed piecemeal November 1942-March 1943. Fought in defensive battles around Tunis. Approximately 11,000 personnel surrendered to Allied forces."
      },
      {
        "name": "Battle of Kasserine Pass",
        "date": "1943-02-19 to 1943-02-25",
        "role": "Elements participated in offensive operations",
        "outcome": "Tactical German victory, strategic withdrawal",
        "notes": "Kampfgruppe Schmid elements involved in Axis offensive"
      }
    ]
  },
  
  "validation": {
    "completeness_tier": "partial_needs_research",
    "completeness_percentage": 58,
    "tier_justification": "Tier 3: 58% complete. Comprehensive organizational structure and deployment context from Tessin Band 14. Personnel estimates based on Kampfgruppe Schmid strength (7,000-11,000 range, using 9,000 mid-point). Equipment partially estimated based on partial regiment/battalion deployments. Key gap: Division never fully formed in Tunisia - most assets remained in France. This is a partial deployment extraction reflecting actual forces present in North Africa 1943 Q1.",
    "confidence_by_section": {
      "command": 90,
      "personnel": 65,
      "tanks": 100,
      "artillery": 60,
      "infantry_weapons": 70,
      "vehicles": 65,
      "supply_logistics": 85,
      "subordinate_units": 80
    },
    "primary_sources": [
      "Tessin, Georg - Verbände und Truppen der deutschen Wehrmacht und Waffen-SS - Band 14",
      "Wikipedia: 1st Fallschirm-Panzer Division Hermann Göring",
      "Web sources on Kampfgruppe Schmid Tunisia deployment"
    ],
    "required_field_gaps": [
      "Exact tank count in Tunisia (0 confirmed - Panzer-Regiment in France)",
      "Precise artillery battery compositions (partial deployment)",
      "Exact halftrack and armored car numbers (estimated from partial units)",
      "Complete vehicle inventory (supply train in France)",
      "Detailed personnel breakdown by rank",
      "Exact ammunition and fuel quantities"
    ],
    "gap_documentation": {
      "tanks": "Tessin explicitly states Panzer-Regiment Hermann Göring was forming in Mont-de-Marsan, France when division deployed to Tunisia. No tank battalion arrived in theater. Division fought as motorized infantry with heavy flak support.",
      "equipment_estimates": "Equipment quantities estimated based on partial battalion/regiment deployments (typically 60-70% of full strength). Full division assets remained in France forming 'Gruppe Neuaufstellungen Div. Herm. Göring'.",
      "personnel_range": "Sources cite 7,000-11,000 personnel in Kampfgruppe Schmid. Used 9,000 as mid-range estimate. Full division authorized strength ~15,000-16,000.",
      "deployment_status": "This is NOT a complete division TO&E but rather Kampfgruppe Schmid - a provisional battle group formed from elements arriving piecemeal in Tunisia. Represents actual forces present 1943 Q1, not authorized establishment."
    },
    "research_recommendations": [
      "German military archives for Kampfgruppe Schmid war diary",
      "Luftwaffe personnel records for exact deployment manifests",
      "Allied intelligence reports on HG Division in Tunisia",
      "Nafziger Collection specific TO&E documents for 1943 German formations",
      "Detailed strength returns for Flak-Regiment General Göring in Tunisia"
    ],
    "extraction_notes": "This extraction represents DEPLOYED FORCES in Tunisia 1943 Q1, not full authorized division strength. The Hermann Göring Division was forming simultaneously in two locations: combat elements in Tunisia (Kampfgruppe Schmid) and heavy equipment/training elements in southern France. The Tunisia element was destroyed May 1943; the France element became the nucleus for reconstitution in Sicily June 1943.",
    "historical_context": "Critical distinction: This is a partial deployment battle group, not a complete panzer division. Tessin makes clear the panzer regiment and 'sämtliche Einheiten' (all units) intended to bring the division to full panzer division strength were forming in France when Tunisia forces were committed and destroyed."
  }
}
