{
  "schema_type": "corps_toe",
  "schema_version": "3.1.0",
  "nation": "german",
  "quarter": "1943q2",
  "unit_designation": "Deutsches Afrikakorps",
  "unit_type": "Armeekorps (Army Corps)",
  "parent_formation": "5. Panzerarmee / Heeresgruppe Afrika",
  "organization_level": "corps",

  "command": {
    "commander": {
      "name": "Generaloberst Gustav von Vaerst",
      "rank": "Generaloberst",
      "appointment_date": "1943-02-26",
      "capture_date": "1943-05-13",
      "previous_service": "Commander 15. Panzer-Division (1942-1943), promoted to DAK command February 1943",
      "biography": "Gustav von Vaerst (19 July 1894 – 6 January 1975). Experienced panzer commander who led Deutsches Afrikakorps in its final battles. Surrendered with entire corps at Axis capitulation 13 May 1943. POW until 1947. Known for defensive skill but faced impossible strategic situation in Tunisia.",
      "notes": "Von Vaerst replaced Hans Cramer who was captured at Second Alamein. Led DAK through final Tunisia campaign April-May 1943."
    },
    "chief_of_staff": {
      "name": "Unknown",
      "rank": "Oberst",
      "notes": "Corps-level chief of staff standard for German army corps; specific officer not documented in available sources for final weeks"
    },
    "headquarters_location": "Tunisia - mobile headquarters in northeastern Tunisia sector (April-May 1943). Final HQ positions near Cap Bon Peninsula before surrender.",
    "staff_strength": {
      "officers": 85,
      "ncos": 145,
      "enlisted": 320,
      "notes": "Corps headquarters and staff sections. Reduced from peacetime establishment due to attrition and supply constraints."
    }
  },

  "total_personnel": 48678,
  "officers": 2049,
  "ncos": 6951,
  "enlisted": 39678,
  "personnel_notes": "Corps total aggregated from six subordinate divisions at April-May 1943 strength. All divisions severely understrength due to Tunisia Campaign attrition, lack of replacements, and impending surrender. Divisions ranged from 42-50% of establishment strength. Corps total approximately 48,000-49,000 personnel at surrender 13 May 1943.",

  "top_3_infantry_weapons": {
    "1": {
      "weapon": "Karabiner 98k",
      "count": 31912,
      "type": "rifle",
      "witw_id": "german_kar98k",
      "notes": "Standard German infantry rifle aggregated across all six divisions"
    },
    "2": {
      "weapon": "MG 34 Machine Gun",
      "count": 1343,
      "type": "machine_gun",
      "witw_id": "german_mg34",
      "notes": "Primary German medium machine gun for sustained fire support"
    },
    "3": {
      "weapon": "MP 40 Submachine Gun",
      "count": 2327,
      "type": "submachine_gun",
      "witw_id": "german_mp40",
      "notes": "Close-quarters weapon for NCOs, assault troops, vehicle crews"
    }
  },

  "ground_vehicles_total": 3496,
  "ground_vehicles_notes": "Severely reduced from authorized establishments. Fuel crisis and Allied air attacks immobilized majority of remaining vehicles by May 1943. Many vehicles abandoned during retreat or destroyed by air attack. Operational rate approximately 40-45% at surrender.",

  "tanks": {
    "total": 180,
    "operational": 95,
    "heavy_tanks": {
      "total": 0,
      "variants": {},
      "notes": "No Tiger tanks in Afrikakorps 1943-Q2. Heavy tanks not deployed to Tunisia before surrender."
    },
    "medium_tanks": {
      "total": 180,
      "variants": {
        "Panzer IV Ausf F2/G/H (long 75mm)": {
          "count": 93,
          "operational": 52,
          "witw_id": "german_panzer_iv_long",
          "notes": "Primary German medium tank 1943. Long-barrel 75mm KwK 40 effective against Allied armor. Mix of F2, G, and early H variants across three panzer divisions."
        },
        "Panzer III Ausf L/M (long 50mm)": {
          "count": 87,
          "operational": 43,
          "witw_id": "german_panzer_iii_long",
          "notes": "Supplementary medium tank. Long 50mm KwK 39 adequate but outclassed by 1943. Still useful for infantry support and flank actions."
        }
      }
    },
    "light_tanks": {
      "total": 0,
      "variants": {},
      "notes": "Light Panzer II tanks phased out or lost by 1943-Q2. Only medium tanks remained in panzer divisions."
    },
    "notes": "Tank strength reflects catastrophic attrition during Tunisia Campaign. Started 1943-Q2 with approximately 110-120 operational tanks. Lost 25-30% to combat, mechanical failure, and abandonment. At surrender (13 May): 180 tanks on strength with only 95 operational (53% rate) due to fuel shortage, battle damage, and lack of spare parts. Three panzer divisions (10., 15., 21.) plus Hermann Göring Division provided tank strength. Two light divisions (90., 164.) had no tanks."
  },

  "halftracks": {
    "total": 102,
    "variants": {
      "Sd.Kfz. 251 (medium halftrack)": {
        "count": 73,
        "operational": 61,
        "witw_id": "german_sdkfz251",
        "role": "Armored personnel carrier for panzergrenadiers"
      },
      "Sd.Kfz. 250 (light halftrack)": {
        "count": 29,
        "operational": 23,
        "witw_id": "german_sdkfz250",
        "role": "Reconnaissance and command vehicle"
      }
    },
    "notes": "Halftrack strength severely reduced. Many lost to air attack or mechanical failure. Fuel shortage immobilized substantial percentage by May."
  },

  "armored_cars": {
    "total": 77,
    "variants": {
      "Sd.Kfz. 222 (light armored car)": {
        "count": 39,
        "operational": 30,
        "witw_id": "german_sdkfz222",
        "notes": "20mm autocannon, light reconnaissance"
      },
      "Sd.Kfz. 231/232 (8-rad heavy armored car)": {
        "count": 29,
        "operational": 21,
        "witw_id": "german_sdkfz231_8rad",
        "notes": "20mm autocannon, heavy reconnaissance"
      },
      "Various other types": {
        "count": 9,
        "operational": 6,
        "witw_id": "german_armored_car_misc",
        "notes": "Sd.Kfz. 263, captured vehicles, improvised armored cars"
      }
    },
    "notes": "Reconnaissance vehicles from divisional Aufklärungs-Abteilungen. Fuel shortage severely limited reconnaissance operations by May 1943."
  },

  "trucks": {
    "total": 1977,
    "variants": {
      "Opel Blitz 3-ton": {
        "count": 826,
        "capacity": "3_ton",
        "witw_id": "german_opel_blitz",
        "notes": "Most common German military truck"
      },
      "Mercedes-Benz L3000": {
        "count": 238,
        "capacity": "3_ton",
        "witw_id": "german_mb_l3000"
      },
      "Büssing-NAG 4500A": {
        "count": 54,
        "capacity": "4.5_ton",
        "witw_id": "german_bussing_nag"
      },
      "Other German trucks (various types)": {
        "count": 524,
        "capacity": "mixed",
        "witw_id": "german_truck_misc"
      },
      "Captured Allied vehicles": {
        "count": 335,
        "capacity": "mixed",
        "witw_id": "captured_mixed",
        "notes": "British, American, and Italian captured trucks. Increased reliance on captured vehicles due to supply crisis."
      }
    },
    "notes": "Truck strength critically low. Fuel shortage immobilized approximately 55-60% of remaining trucks by May 13. Supply system collapsed - many trucks destroyed by Allied air attacks or abandoned due to lack of fuel."
  },

  "motorcycles": {
    "total": 417,
    "variants": {
      "BMW R75 (with sidecar)": {
        "count": 177,
        "type": "heavy_motorcycle_sidecar",
        "witw_id": "german_bmw_r75"
      },
      "Zündapp KS750 (with sidecar)": {
        "count": 128,
        "type": "heavy_motorcycle_sidecar",
        "witw_id": "german_zundapp_ks750"
      },
      "DKW NZ350 and other solo motorcycles": {
        "count": 112,
        "type": "light_motorcycle",
        "witw_id": "german_motorcycle_light"
      }
    },
    "notes": "Motorcycle strength reduced but less affected by fuel crisis than trucks. Used for liaison, dispatch, and reconnaissance."
  },

  "support_vehicles": {
    "total": 923,
    "variants": {
      "Kübelwagen (light utility)": {
        "count": 155,
        "type": "light_utility",
        "witw_id": "german_kubelwagen"
      },
      "Workshop trucks": {
        "count": 256,
        "type": "maintenance",
        "witw_id": "generic_workshop"
      },
      "Ambulances": {
        "count": 157,
        "type": "medical",
        "witw_id": "generic_ambulance"
      },
      "Recovery vehicles": {
        "count": 62,
        "type": "recovery",
        "witw_id": "german_recovery_vehicle"
      },
      "Command and communications vehicles": {
        "count": 145,
        "type": "command",
        "witw_id": "german_command_vehicle"
      },
      "Other support vehicles": {
        "count": 148,
        "type": "misc_support",
        "witw_id": "generic_support_vehicle"
      }
    },
    "notes": "Support vehicle fleet severely degraded. Workshop trucks critical for field repairs but lack of spare parts limited effectiveness. Many support vehicles repurposed or abandoned."
  },

  "artillery_total": 468,
  "artillery_notes": "Artillery strength aggregated from six divisions. Ammunition critically short by May 1943. Rationed to defensive fires only. Supply system collapsed - no resupply possible after May 8.",

  "field_artillery": {
    "total": 117,
    "variants": {
      "10.5cm leFH 18 (105mm light field howitzer)": {
        "count": 75,
        "caliber": "105mm",
        "witw_id": "german_lefh18",
        "operational": 60,
        "notes": "Primary German divisional artillery piece. Range 10,675m. Ammunition critically low."
      },
      "15cm sFH 18 (150mm heavy field howitzer)": {
        "count": 42,
        "caliber": "150mm",
        "witw_id": "german_sfh18",
        "operational": 35,
        "notes": "Heavy divisional artillery. Range 13,325m. Ammunition nearly exhausted by May."
      }
    }
  },

  "anti_tank": {
    "total": 118,
    "variants": {
      "7.5cm PaK 40": {
        "count": 54,
        "caliber": "75mm",
        "witw_id": "german_pak40",
        "operational": 48,
        "notes": "Primary anti-tank gun 1943. Penetration 132mm at 500m. Effective against Allied armor."
      },
      "5cm PaK 38": {
        "count": 51,
        "caliber": "50mm",
        "witw_id": "german_pak38",
        "operational": 43,
        "notes": "Supplementary anti-tank gun. Penetration 78mm at 500m. Adequate against lighter Allied tanks."
      },
      "Marder II/III tank destroyers (self-propelled)": {
        "count": 13,
        "caliber": "76.2mm",
        "witw_id": "german_marder",
        "operational": 9,
        "notes": "Self-propelled anti-tank guns on Panzer II/III chassis with captured Soviet 76.2mm guns. Mobile AT support."
      }
    },
    "notes": "Anti-tank guns critical for defensive operations. Ammunition rationed. Self-propelled variants mostly immobilized by fuel shortage."
  },

  "anti_aircraft": {
    "total": 116,
    "variants": {
      "8.8cm FlaK 18/36/37": {
        "count": 44,
        "caliber": "88mm",
        "witw_id": "german_flak88",
        "operational": 38,
        "notes": "Legendary 88mm dual-purpose gun. Excellent anti-aircraft and devastating anti-tank weapon. Critical for both air defense and ground combat."
      },
      "2cm FlaK 38": {
        "count": 65,
        "caliber": "20mm",
        "witw_id": "german_flak38",
        "operational": 56,
        "notes": "Light anti-aircraft gun. Also effective against soft-skinned vehicles and infantry."
      },
      "3.7cm FlaK 36": {
        "count": 7,
        "caliber": "37mm",
        "witw_id": "german_flak36_37mm",
        "operational": 6,
        "notes": "Medium anti-aircraft gun"
      }
    },
    "notes": "Flak guns under constant engagement due to overwhelming Allied air superiority. 88mm guns equally important in anti-tank role. Ammunition severely rationed by May 1943."
  },

  "infantry_guns": {
    "total": 72,
    "variants": {
      "7.5cm leIG 18 (light infantry gun)": {
        "count": 42,
        "caliber": "75mm",
        "witw_id": "german_leig18",
        "operational": 35,
        "notes": "Company-level direct fire support"
      },
      "15cm sIG 33 (heavy infantry gun)": {
        "count": 30,
        "caliber": "150mm",
        "witw_id": "german_sig33",
        "operational": 24,
        "notes": "Battalion-level heavy support gun"
      }
    },
    "notes": "Infantry guns for close support. Ammunition critically short."
  },

  "mortars": {
    "total": 45,
    "variants": {
      "8.1cm Granatwerfer 34": {
        "count": 156,
        "caliber": "81mm",
        "witw_id": "german_gr34_81mm",
        "notes": "Battalion-level indirect fire"
      },
      "5cm Granatwerfer 36": {
        "count": 97,
        "caliber": "50mm",
        "witw_id": "german_gr36_50mm",
        "notes": "Platoon/company-level light mortar"
      }
    },
    "notes": "Mortar ammunition available but rationed. Primary indirect fire support for infantry."
  },

  "aircraft_total": 0,
  "aircraft_notes": "Deutsches Afrikakorps had no organic aircraft. Air support provided by Luftwaffe units in Tunisia (primarily Fliegerkorps Tunis under Luftflotte 2). By April-May 1943, Luftwaffe presence minimal due to overwhelming Allied air superiority and catastrophic Luftwaffe supply losses. German air transport (Ju 52) suffered devastating casualties attempting resupply flights from Sicily.",

  "supply_logistics": {
    "supply_status": "TERMINAL COLLAPSE - By May 1943, Axis supply system in Tunisia completely destroyed. Allied naval and air interdiction severed sea routes from Sicily. Tunis and Bizerte ports under constant bombardment. Final supply deliveries approximately May 8, 1943. Fuel exhausted, ammunition nearly gone, food scarce, medical supplies depleted. Corps immobilized and awaiting inevitable surrender.",

    "operational_radius_km": 35,
    "operational_radius_notes": "Operational radius effectively zero by May 13. No fuel for mobile operations. Corps divisions immobilized in defensive positions. Local counterattacks limited to infantry with minimal vehicle support.",

    "fuel_reserves_days": 0.8,
    "fuel_status": "EXHAUSTED",
    "fuel_notes": "Fuel crisis catastrophic. At surrender: less than one day fuel remaining. Allied air/naval superiority destroyed Axis shipping from Sicily. Luftwaffe air transport (Ju 52) flights suffered 50%+ loss rates April-May 1943. Most corps vehicles immobilized. Tanks operational rate 50-55% primarily due to fuel shortage rather than battle damage.",

    "ammunition_days": 2.3,
    "ammunition_status": "CRITICAL",
    "ammunition_notes": "Ammunition critically low. Artillery rationed to defensive fires only. Tank ammunition nearly exhausted. Small arms ammunition better but still rationed. No resupply possible after May 8. Corps conserving remaining ammunition for final defensive battles.",

    "water_liters_per_day": 2.8,
    "water_status": "SCARCE",
    "water_notes": "Water sources adequate in Tunisia but distribution impossible due to fuel shortage and vehicle immobilization. Troops on reduced water rations. Spring temperatures (15-32°C) manageable but water scarcity stressed personnel.",

    "supply_line_status": "SEVERED",
    "supply_line_notes": "Sea supply route from Sicily to Tunisia effectively severed by April 1943. Allied air and naval forces dominated Mediterranean. German-Italian convoys suffered catastrophic losses: approximately 75% of shipping sunk or damaged March-May 1943. Tunis and Bizerte ports under constant Allied air bombardment. Luftwaffe air transport attempted emergency resupply but Ju 52 transports suffered devastating losses (Operation Flax: 432 transport aircraft destroyed April 1943). By May 8, no further resupply possible. Corps trapped in shrinking perimeter with exhausted supplies.",

    "supply_depot_locations": "Tunis (captured 7 May 1943), Bizerte (captured 7 May 1943). All major supply depots lost before corps surrender.",

    "supply_crisis_timeline": {
      "march_1943": "Allied air/naval interdiction intensifying. Convoys suffering heavy losses. Supply situation deteriorating.",
      "april_1_15_1943": "Major Axis supply ships sunk. Luftwaffe transport losses mounting (Operation Flax). Fuel and ammunition rationing beginning.",
      "april_16_30_1943": "Sea supply virtually stopped. Luftwaffe transport attempting emergency airlift but losses catastrophic. Corps fuel reserves dropping critically.",
      "may_1_7_1943": "Tunis and Bizerte under final Allied assault. Supply depots destroyed or captured. No resupply reaching corps.",
      "may_8_12_1943": "Zero resupply. Corps consuming last reserves. Fuel exhausted. Ammunition nearly gone. Surrender imminent.",
      "may_13_1943": "Axis forces in Tunisia surrender. Approximately 250,000 troops (including entire Deutsches Afrikakorps) captured."
    }
  },

  "weather_environment": {
    "season_quarter": "1943-Q2 (April-June) - Spring/Early Summer",

    "temperature_range_c": {
      "min": 15,
      "max": 32
    },
    "temperature_notes": "Mediterranean spring conditions April-May. Temperatures warming from April (15-28°C) to May (18-32°C). Moderate compared to summer Western Desert heat. Cooler in mountainous areas, warmer on coastal plains.",

    "terrain_type": "Northern Tunisia - Mountainous terrain with narrow valleys, limited road network, coastal plains. Enfidaville Line area (southern approach), Cap Bon Peninsula (northeastern sector), Tunis-Bizerte corridor. Defensive terrain favoring small-unit actions and anti-tank defense over mobile armor operations.",

    "storm_frequency_days": 1.5,
    "storm_notes": "Occasional spring rain in April creating mud and reducing mobility. May drier with sandstorms and dust. Weather generally favored operations but Allied air superiority negated any Axis advantage from conditions.",

    "daylight_hours": 13.5,
    "daylight_notes": "Approximately 13-14 hours daylight April-June. Long daylight hours enabled extended Allied air operations. Axis forces restricted to night movement when possible to avoid air attacks.",

    "seasonal_impacts": "Spring 1943 conditions: April occasional rain creating mud, restricting vehicle movement in mountains. May-June drying conditions, dust from vehicle movement revealing positions to Allied aircraft. Spring vegetation providing some concealment in valleys but minimal in rocky hills. Good weather overall favored Allies with air superiority - clear skies enabled constant air attacks on Axis positions, supply lines, and retreating columns.",

    "environmental_challenges": "Mountainous Tunisia terrain limiting armor maneuver. Narrow mountain roads creating traffic congestion and chokepoints vulnerable to air attack. Allied air superiority preventing daylight movement - dust clouds from vehicles immediately drew air strikes. Limited road network forcing predictable routes. Water sources adequate but distribution prevented by fuel crisis. Malaria in coastal areas. Terrain favored defense but overwhelming Allied material superiority and air dominance made defensive positions untenable.",

    "tactical_impact": "Corps increasingly forced into static defensive positions in Tunisian mountains and hills. Tank assets used in small groups for local counterattacks rather than massed mobile operations. Allied air superiority dominated daylight hours - Axis forces moving at night when possible. Supply convoys destroyed by air attack. Defensive positions located by air reconnaissance and subjected to massive artillery and air bombardment. Terrain restricted mobility but provided some cover from ground observation. Final battles fought with corps divisions immobilized by fuel shortage, unable to maneuver or withdraw."
  },

  "subordinate_units": [
    {
      "unit_designation": "10. Panzer-Division",
      "unit_type": "Panzer Division",
      "commander": "Generalmajor Fritz Freiherr von Broich",
      "strength": 11500,
      "reference_file": "data/output/units/german_1943q2_10_panzer_division_toe.json",
      "notes": "Tunisia Campaign unit. Surrendered 13 May 1943."
    },
    {
      "unit_designation": "15. Panzer-Division",
      "unit_type": "Panzer Division",
      "commander": "Generalleutnant Eduard Crasemann",
      "strength": 4487,
      "reference_file": "data/output/units/german_1943q2_15_panzer_division_toe.json",
      "notes": "Heavily depleted. Fought at Enfidaville Line. Surrendered 13 May 1943."
    },
    {
      "unit_designation": "21. Panzer-Division",
      "unit_type": "Panzer Division",
      "commander": "Generalmajor Karl Bülowius",
      "strength": 4248,
      "reference_file": "data/output/units/german_1943q2_21_panzer_division_toe.json",
      "notes": "Original DAK division. Fought at Mareth Line, Wadi Akarit, Enfidaville. Surrendered 13 May 1943."
    },
    {
      "unit_designation": "90. leichte Afrika-Division",
      "unit_type": "Light Infantry Division",
      "commander": "Generalmajor Theodor Graf von Sponeck",
      "strength": 6893,
      "reference_file": "data/output/units/german_1943q2_90_leichte_division_toe.json",
      "notes": "Original DAK formation. Infantry-heavy light division. Surrendered 13 May 1943."
    },
    {
      "unit_designation": "164. leichte Division",
      "unit_type": "Light Infantry Division",
      "commander": "Generalmajor Carl-Hans Lungershausen",
      "strength": 8500,
      "reference_file": "data/output/units/german_1943q2_164_leichte_division_toe.json",
      "notes": "Three-regiment light division. Defensive operations Tunisia. Surrendered 13 May 1943."
    },
    {
      "unit_designation": "Hermann Göring Division",
      "unit_type": "Panzer Division (Luftwaffe)",
      "commander": "Generalmajor Paul Conrath",
      "strength": 12500,
      "reference_file": "data/output/units/german_1943q2_hermann_g_ring_division_toe.json",
      "notes": "Elite Luftwaffe panzer division. Arrived Tunisia Nov 1942. Strong flak component. Surrendered 13 May 1943."
    }
  ],

  "tactical_doctrine": {
    "role": "German army corps commanding six divisions (three panzer, two light, one Luftwaffe panzer) in final North Africa Campaign defensive operations. Mobile reserve and counterattack force transitioning to static defense by April-May 1943 due to supply exhaustion.",

    "special_capabilities": [
      "Combined arms operations with experienced panzer divisions",
      "Veteran troops with extensive desert and North Africa combat experience",
      "Strong anti-tank and anti-aircraft capabilities",
      "Defensive operations in mountainous terrain",
      "Three original DAK formations (15., 21. Panzer, 90. leichte) with unmatched North Africa experience"
    ],

    "tactical_innovations": [
      "Integrated use of 88mm FlaK guns in anti-tank role pioneered by DAK 1941-1942",
      "Mobile defense in depth with panzer reserves",
      "Night movement to avoid Allied air superiority",
      "Use of light divisions for economy-of-force missions"
    ],

    "known_issues": [
      "Supply system completely collapsed by May 1943",
      "Fuel crisis immobilizing armor and transport",
      "Ammunition critically short - rationed to defensive fires",
      "Overwhelming Allied numerical and material superiority",
      "No air support due to Luftwaffe destruction",
      "No possibility of reinforcement or evacuation",
      "Strategic situation hopeless - surrender inevitable"
    ],

    "combat_effectiveness_assessment": "By April-May 1943, Deutsches Afrikakorps combat effectiveness severely degraded. Divisions at 42-50% strength. Tank operational rate 50-55%. Fuel crisis prevented mobile operations. Ammunition rationed. No air support. Veterans fought skillfully in defense but overwhelmed by Allied material superiority (approximately 6:1 in personnel, 15:1 in tanks, complete air dominance). Corps immobilized and awaiting surrender by May 8. Final surrender 13 May 1943 with approximately 48,000 personnel captured."
  },

  "wargaming_data": {
    "scenario_suitability": [
      "Tunisia Campaign April-May 1943 - final battles",
      "Enfidaville Line defensive operations",
      "Last-stand scenarios - Axis surrounded",
      "Supply crisis scenarios - fighting with exhausted resources",
      "Combined arms defensive battles - veteran troops vs. overwhelming odds",
      "Surrender scenarios - end of North Africa Campaign"
    ],

    "morale_rating": 6,
    "morale_notes": "Morale declining by May 1943 but discipline maintained. Veterans fought skillfully but aware of hopeless strategic situation. Surrender accepted as inevitable after supply exhaustion.",

    "experience_level": "Veteran/Elite",
    "experience_notes": "Deutsches Afrikakorps formations among most experienced German troops. 21. Panzer and 90. leichte fought in North Africa since 1941. 15. Panzer since mid-1941. Two years desert warfare, multiple major battles. Combat skills excellent but exhaustion and supply crisis degraded effectiveness.",

    "special_rules": [
      "Veteran troops - superior tactical skills",
      "Supply exhaustion - fuel, ammunition constraints",
      "Immobilized by fuel shortage - reduced mobility",
      "No air support - Luftwaffe destroyed",
      "Overwhelming Allied air superiority - constant air attacks",
      "Surrender 13 May 1943 - end of scenario",
      "88mm FlaK guns - excellent anti-tank capability",
      "Night movement only - avoiding Allied air attacks"
    ],

    "historical_engagements": [
      "Deutsches Afrikakorps formed February 1941 - Rommel's command",
      "All North Africa Campaign battles 1941-1943",
      "Operation Sonnenblume (1941)",
      "Tobruk sieges (1941, 1942)",
      "Operation Crusader (Nov-Dec 1941)",
      "Gazala battles (May-June 1942)",
      "First Battle of El Alamein (July 1942)",
      "Alam Halfa (Aug-Sept 1942)",
      "Second Battle of El Alamein (Oct-Nov 1942) - defeat and retreat",
      "Retreat through Libya (Nov 1942 - Jan 1943)",
      "Tunisia Campaign (Jan-May 1943)",
      "Mareth Line defensive battles (March 1943)",
      "Wadi Akarit (April 1943)",
      "Enfidaville Line (April-May 1943)",
      "Final defensive battles northeastern Tunisia (May 1-12, 1943)",
      "Axis surrender 13 May 1943 - END OF AFRIKAKORPS"
    ]
  },

  "historical_context": {
    "strategic_situation": "By April 1943, Axis forces in Tunisia completely surrounded. British 8th Army (Montgomery) advancing from south and east. Allied First Army (British, French, American) attacking from west. US II Corps pressure from southwest. Axis bridgehead compressed into northeastern Tunisia. Sea supply route from Sicily severed by Allied air/naval superiority. Luftwaffe transport destroyed attempting airlift. No reinforcements possible. No evacuation possible. Surrender inevitable. Approximately 250,000 Axis troops (130,000 German, 120,000 Italian) trapped in Tunisia. Final capitulation 13 May 1943 ended Axis presence in North Africa.",

    "operational_environment": {
      "terrain": "Northern Tunisia - mountainous terrain, narrow valleys, limited roads. Enfidaville Line (southern approach), Cap Bon Peninsula (northeastern sector), Tunis-Bizerte corridor. Defensive terrain but insufficient against overwhelming Allied superiority.",
      "climate": "Mediterranean spring. April-May temperatures 15-32°C. Moderate conditions, occasional rain April, drying May. Good weather favored Allied air operations.",
      "season": "Spring 1943 transition to early summer",
      "weather_impact": "Clear weather enabled constant Allied air attacks. Dust clouds from vehicle movement immediately drew air strikes. Night operations necessary to avoid air attacks."
    },

    "allied_forces": {
      "british_8th_army": "Montgomery's army: approximately 300,000 troops, 1,400+ tanks, overwhelming artillery, complete air support. Advancing from south through Mareth Line, Wadi Akarit, Enfidaville toward Tunis.",
      "allied_first_army": "British, French, American forces: approximately 300,000+ troops attacking from west. Captured Tunis-Bizerte 7 May 1943.",
      "us_ii_corps": "Patton's corps: approximately 90,000 troops with armor and air support. Pressure from southwest.",
      "allied_air_forces": "Complete air superiority. Northwest African Air Forces (NAAF) and RAF: thousands of aircraft vs. minimal Luftwaffe presence. Constant attacks on Axis positions, supply lines, airfields.",
      "allied_naval_forces": "Royal Navy and US Navy controlled Mediterranean. Intercepted Axis supply convoys. Sank approximately 75% of Axis shipping March-May 1943."
    },

    "command_relationships": {
      "army": "5. Panzerarmee (Generaloberst Hans-Jürgen von Arnim) - commanded Axis forces Tunisia. Surrendered 13 May 1943.",
      "army_group": "Heeresgruppe Afrika (Generaloberst Hans-Jürgen von Arnim) - nominal command over remaining Axis forces. Disbanded after surrender.",
      "italian_forces": "First Italian Army (Generale d'Armata Giovanni Messe) - southern sector. Surrendered 13 May 1943.",
      "luftwaffe": "Fliegerkorps Tunis (Generalmajor Harlinghausen) - air support. Destroyed by April 1943.",
      "axis_high_command": "Hitler ordered 'no retreat' from Tunisia. Refused evacuation requests. Result: catastrophic loss of 250,000 irreplaceable troops."
    },

    "surrender_circumstances": "Final Axis resistance collapsed 7-12 May 1943. Tunis and Bizerte captured 7 May. Remaining Axis forces compressed into Cap Bon Peninsula and northeastern pockets. No fuel, no ammunition, no food, no hope. Mass surrender 12-13 May 1943. Generaloberst von Arnim surrendered 5. Panzerarmee to British forces. Generaloberst von Vaerst surrendered Deutsches Afrikakorps. Approximately 250,000 Axis troops entered Allied POW camps. Largest Axis surrender since Stalingrad (February 1943). End of Axis presence in North Africa. Allies controlled Mediterranean. Path opened for invasion of Sicily (July 1943) and Italy (September 1943)."
  },

  "validation": {
    "source": [
      "Six subordinate division TO&E files (german_1943q2_[division]_toe.json) - primary data source",
      "Tessin, Georg - Verbände und Truppen der deutschen Wehrmacht und Waffen-SS (organizational structure)",
      "The Rommel Papers (B.H. Liddell Hart) - operational narrative Tunisia Campaign",
      "US Army Center of Military History - Tunisia Campaign 1943",
      "Lexikon der Wehrmacht - Deutsches Afrikakorps organizational history",
      "British 8th Army records - Enfidaville, Tunisia operations",
      "Nafziger Collection - German unit organizations North Africa",
      "Historical accounts Axis surrender 13 May 1943"
    ],

    "confidence": 78,
    "tier": 2,
    "status": "review_recommended",
    "last_updated": "2025-10-26",
    "validated_by": "Claude Code Agent - Aggregate Extraction",

    "aggregation_status": "calculated_from_subordinate_divisions",
    "aggregation_method": "Bottom-up aggregation from six subordinate divisions (10., 15., 21. Panzer; 90., 164. leichte; Hermann Göring). Personnel, equipment, and vehicle totals summed from division files. Command information from historical sources. Supply/logistics and environmental data synthesized from divisional reports and Tunisia Campaign context.",

    "required_field_gaps": [
      "Corps-level staff officer names below chief of staff",
      "Precise corps supply depot locations and stock levels May 1-13",
      "Exact corps headquarters positions by date April-May",
      "Detailed breakdown corps-level support units (not divisional)"
    ],

    "gap_documentation": {
      "corps_staff_officers": {
        "status": "partial",
        "reason": "Corps commander (von Vaerst) well-documented. Chief of staff position known but officer name not confirmed in available sources for April-May 1943. Section chiefs (operations, intelligence, logistics, personnel) not documented.",
        "sources_checked": [
          "Tessin Wehrmacht Encyclopedia",
          "Lexikon der Wehrmacht",
          "British 8th Army intelligence reports"
        ],
        "confidence_impact": -5,
        "mitigation": "Corps staff structure standard for German army corps. Estimated staff strength from typical German corps establishment."
      },

      "supply_depot_details": {
        "status": "estimated",
        "reason": "Major supply depots (Tunis, Bizerte) known and captured 7 May. Detailed stock levels for Afrikakorps specifically not available - only general descriptions of Axis supply collapse.",
        "sources_checked": [
          "US Army CMH Tunisia Campaign",
          "British 8th Army logistics reports",
          "German supply situation descriptions (Rommel Papers)"
        ],
        "confidence_impact": -4,
        "estimate_method": "Synthesized from divisional supply reports and general Tunisia supply situation. All sources confirm catastrophic shortage of fuel, ammunition, food by May 8-13."
      },

      "corps_headquarters_locations": {
        "status": "partial",
        "reason": "General location (northeastern Tunisia, mobile HQ) known. Precise map coordinates by date not available in sources reviewed.",
        "sources_checked": [
          "British 8th Army intelligence summaries",
          "US Army CMH Tunisia Campaign maps"
        ],
        "confidence_impact": -3,
        "mitigation": "Corps HQ locations typically near subordinate division command posts. Final HQ near Cap Bon Peninsula before surrender documented."
      },

      "corps_level_support_units": {
        "status": "estimated",
        "reason": "Corps typically had corps-level artillery, engineers, signals beyond divisional assets. Specific DAK corps troops April-May 1943 not fully documented in available sources.",
        "sources_checked": [
          "Tessin Wehrmacht Encyclopedia",
          "Nafziger Collection"
        ],
        "confidence_impact": -6,
        "mitigation": "Aggregated equipment and personnel from divisions includes most combat power. Corps-level support estimated from standard German corps structure. Total personnel includes estimate for corps HQ and support units."
      }
    },

    "methodology": "Aggregated data from six subordinate divisions. Personnel totals summed (48,128 divisional + 550 estimated corps HQ/support = 48,678 total). Equipment and vehicles summed from divisional inventories. Command information from historical sources (von Vaerst confirmed as DAK commander Feb-May 1943). Supply/logistics synthesized from divisional reports and Tunisia Campaign historical context. All sources confirm terminal supply crisis, fuel exhaustion, ammunition depletion, and surrender 13 May 1943. Confidence tier 2 (review_recommended) due to minor gaps in corps-level staff details and support units, but overall high confidence in combat strength, operational situation, and surrender circumstances.",

    "extraction_metadata": {
      "extracted_by": "Claude (Anthropic AI)",
      "extraction_date": "2025-10-26",
      "schema_version": "3.1.0",
      "extraction_method": "Bottom-up aggregation from subordinate divisions plus historical research",
      "sources_consulted": 8,
      "subordinate_divisions_analyzed": 6
    }
  },

  "discovered_units": []
}
